'''
cafe는 각 4개의 유니코드로 이뤄져 있다.
utf-8 인코딩을 통해 str을 bytes로 인코딩한다
바이트는 접두사 b로 시작한다
개념 쉽게 이해하기 -> 유니코드는 사람이 읽을 수 있는 텍스트, bytes는 기계 메모리 덤프이다.
                  byte를 텍스트로 변환하는 것이 디코딩, str을 저장하거나 전송하기 위해 bytes로 변환하는 과정을 인코딩(암호화) 한다고 한다.

- 구조체와 메모리뷰
struct 모듈은 패킹된 바이트를 다양한 형의 필드로 구성된 튜플로 분석하고, 반대로 튜플을 패킹된 바이트로 변환하는 함수를 제공한다.
 * 메모리뷰 내장 클래스는 공유 메모리 시퀀스로서 bytes를 복사하지 않고 배열의 슬라이스를 다룰 수 있게 한다.

- 인코딩 / 디코딩
바이트 시퀀스의 인코딩 방식을 알아낼 수 있는 방법은 인코딩 정보를 별도로 가져오는 방법밖에 없다.
http, xml은 헤더에 인코딩 정보가 있다. 

- 텍스트 파일 다루기
텍스트를 처리하는 최고의 방법 -> 유니코드 샌드위치
입력 : bytes -> str
처리 : 100% string만 처리
출력 : str -> bytes
write, read할 때 같은 인코딩을 지정해줘야한다. 기본 인코딩에 의존하면 안된다.

'''
